<!doctype html>
<html lang="en">
  <head>
    <!-- Required meta tags -->
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">

    <!-- Bootstrap CSS -->
    <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootswatch/4.5.0/cyborg/bootstrap.min.css" crossorigin="anonymous"/>
    
    <title>WBSim</title>
  </head>
  <body>   
    
    <div class="p-3 mb-2 bg-primary text-light">Testovacia Beta Verzia 0.1</div>
    
    <div class="card mb-3">
      <img class="card-img-top" src="https://cdn.glitch.com/ff4647b2-2e58-40ed-b23c-9fd2e8e158a3%2FheaderPNG%20copy.png?v=1596939792299" alt="Card image cap">
        <!--   <div class="card-body">
                <h5 class="card-title">Card title</h5>
                <p class="card-text">This is a wider card with supporting text below as a natural lead-in to additional content. This content is a little bit longer.</p>
                <p class="card-text"><small class="text-muted">Last updated 3 mins ago</small></p>
               </div> -->
    </div>
    
    <div class="card text">
      <div class="container-fluid">
        <h4 class="_2cuy _3dgx _2vxa"><span style="font-family: verdana, geneva;"><p>
          </p>Multiplatformov&yacute; Simul&aacute;tor pre V&scaron;etk&yacute;ch nad&scaron;encov hromadnej dopravy</span></h4>
        <div class="alert alert-secondary">
           
            <div class="_2cuy _3dgx _2vxa"><span style="font-family: verdana, geneva;">V roku 2019 vznikla my&scaron;lienka realizovať <strong>hern&yacute; svet dostupn&yacute; pre hr&aacute;čov na r&ocirc;znych platform&aacute;ch</strong> počn&uacute;c operačn&yacute;m syst&eacute;mom a hardv&eacute;rom. Vzhľadom na existuj&uacute;ce hern&eacute; simul&aacute;tory bola t&aacute;to my&scaron;lienka popul&aacute;rnou, hlavne kv&ocirc;li obmedzeniam, ktor&eacute; často limituj&uacute; použ&iacute;vateľov pri in&scaron;tal&aacute;cii a podpore ak&eacute;hokoľvek hern&eacute;ho softv&eacute;ru. </span></div>
            <div class="_2cuy _3dgx _2vxa"><br /><span style="font-family: verdana, geneva;">Napriek veľk&eacute;mu počtu dostupn&yacute;ch hern&yacute;ch simul&aacute;torov sme sa rozhodli vytvoriť webov&uacute; platformu, ktor&aacute; nie je &uacute;plne z&aacute;visl&aacute; od jedn&eacute;ho operačn&eacute;ho syst&eacute;mu a koncov&eacute;ho zariadenia, na ktorom sa simul&aacute;tor m&ocirc;že sp&uacute;sťať. T&aacute;to webov&aacute; platforma bola v prv&yacute;ch &scaron;t&aacute;di&aacute;ch testovan&aacute; na &uacute;rovniach kolaborat&iacute;vnej virtu&aacute;lnej reality, pričom jej v&yacute;voj dospel k rie&scaron;eniu ot&aacute;zky zaoberaj&uacute;cej sa podobne simul&aacute;ciou vozidiel v spoločne zdieľanom virtu&aacute;lnom svete.</span></div>
            <div class="_2cuy _3dgx _2vxa">&nbsp;</div>
            <div class="_2cuy _3dgx _2vxa"><span style="font-family: verdana, geneva;">Na&scaron;im z&aacute;merom bolo vytvoriť virtu&aacute;lne prostredie dostupn&eacute; prostredn&iacute;ctvom webov&yacute;ch prehliadačov, v ktorom m&ocirc;že skupina použ&iacute;vateľov ovl&aacute;dať trojrozmern&eacute; vozidl&aacute;. Vďaka dostupn&yacute;m webov&yacute;m technol&oacute;gi&aacute;m a v&yacute;počtov&eacute;mu v&yacute;konu dne&scaron;n&yacute;ch informačn&yacute;ch syst&eacute;mov bol vytvoren&yacute; prototyp zdieľan&eacute;ho simul&aacute;tora pre riadenie vozidla autobusu v re&aacute;lnom čase. </span><br /><br /><span style="font-family: verdana, geneva;">Na rozdiel od existuj&uacute;cich simul&aacute;torov je na&scaron;&iacute;m z&aacute;merom poskytn&uacute;ť použ&iacute;vateľom spoločn&yacute; zdieľan&yacute; priestor bez potreb in&scaron;tal&aacute;cie ak&yacute;chkoľvek softv&eacute;rov&yacute;ch bal&iacute;čkov a r&aacute;mcov. Rovnako sme pripraven&iacute; prelomiť doteraj&scaron;ie limit&aacute;cie v pr&iacute;stupe a umožniť použ&iacute;vateľom zdieľať svoje hern&eacute; z&aacute;žitky z ak&yacute;chkoľvek zariaden&iacute;, ktor&eacute; disponuj&uacute; webov&yacute;m prehliadačom. Do tejto skupiny s&uacute; zaraden&eacute; desktopov&eacute; stanice, notebooky, smartf&oacute;ny, d&aacute;tov&eacute; prilby (virtu&aacute;lna VR a zmie&scaron;an&aacute; realita MR) ale rovnako aj inteligentn&eacute; telev&iacute;zory.</span>&nbsp;</div>
            <p><span style="font-family: verdana, geneva;">Začiatkom augusta 2020 očak&aacute;vame pr&iacute;chod prvej betaverzie, ktor&aacute; bude av&scaron;ak limitovan&aacute; len pre smartf&oacute;ny a poč&iacute;tače. Betaverzia bude obsahovať tri vozidl&aacute;, mapu a ovl&aacute;danie pohľadu kamery vo virtu&aacute;lnom svete. Použ&iacute;vatelia bud&uacute; m&ocirc;cť pristupovať k simul&aacute;toru prostredn&iacute;ctvom URL adresy. V nasleduj&uacute;cich verzi&aacute;ch je možn&eacute; očak&aacute;vať n&aacute;rast podpory ďal&scaron;&iacute;ch zariaden&iacute; a roz&scaron;&iacute;renie funkcionality simul&aacute;tora, počtu m&aacute;p, nočn&eacute;ho režimu. Rovnako uvažujeme nad možnosťou roz&scaron;&iacute;renia dynamick&yacute;ch efektov, ako je fyzika vozidla, elev&aacute;cia ter&eacute;nu. Postupom v&yacute;voja bude verzia publikovan&aacute; v podobe ďal&scaron;&iacute;ch betaverzi&iacute;.</span></p>
          
        </div>

      <div class="alert alert-secondary"> 
        <h5><p>Poďakovanie</p></h5> 

            <ul>
            <li><a href="https://aframe.io/">A-Frame</a> za v&yacute;voj platformy pre r&yacute;chle prototypovanie a tvorbu Virtu&aacute;lno Realitn&yacute;ch prostred&iacute; na webe.</li>
            <li><a href="https://github.com/networked-aframe">Networked-Aframe</a> za v&yacute;voj platformy pre zdieľanie hern&eacute;ho sveta prostredn&iacute;ctvom webov&yacute;ch prehliadačov.</li>
            <li class="LC20lb DKV0Md">Dopravn&iacute; web
            <ul>
            <li class="LC20lb DKV0Md">Za možnosti využitia a editáciu dostupn&yacute;ch podkladov (papierov&yacute;ch modelov) pre text&uacute;ry vozidiel Karosa B732 a Karosa B952.</li>
            </ul>
            </li>
            <li>Franti&scaron;kovi &Scaron;imč&aacute;kovi
            <ul>
            <li>Za poskytnutie podkladov (papierov&yacute;ch modelov) pre text&uacute;ry vozidla Karosa &Scaron;M.</li>
            </ul>
            </li>
            </ul>
      </div>
      </div>
    </div>
    
    <!-- Footer -->
    <footer class="page-footer font-small blue">
      <div class="footer-copyright text-center py-3">2020 Web Bus Simulator : 
        <a href="https://www.facebook.com/WBSimulation"> Oficiálna Facebook Stránka</a>
      </div>
    </footer>
    <!-- Footer -->
    
    
    
    <!-- Optional JavaScript -->
    <!-- jQuery first, then Popper.js, then Bootstrap JS -->
    <script src="https://code.jquery.com/jquery-3.5.1.slim.min.js" integrity="sha384-DfXdz2htPH0lsSSs5nCTpuj/zy4C+OGpamoFVy38MVBnE+IbbVYUew+OrCXaRkfj" crossorigin="anonymous"></script>
    <script src="https://cdn.jsdelivr.net/npm/popper.js@1.16.0/dist/umd/popper.min.js" integrity="sha384-Q6E9RHvbIyZFJoft+2mJbHaEWldlvI9IOYy5n3zV9zzTtmI3UksdQRVvoxMfooAo" crossorigin="anonymous"></script>
    <script src="https://stackpath.bootstrapcdn.com/bootstrap/4.5.0/js/bootstrap.min.js" integrity="sha384-OgVRvuATP1z7JjHLkuOU7Xw704+h835Lr+6QL9UvYjZE3Ipu6Tp75j7Bh/kR0JKI" crossorigin="anonymous"></script>
  </body>
</html>